Revit 2017 API
PipingSystem.FixtureUnits Property
 The fixture units of this piping system
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2017. Please use GetFixtureUnits method instead.")]
public double FixtureUnits { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2017. Please use GetFixtureUnits method instead.")> _
Public ReadOnly Property FixtureUnits As Double
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2017. Please use GetFixtureUnits method instead.")]
public:
property double FixtureUnits {
	double get ();
}
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace